brew 'openssl'
brew 'readline'
brew 'ffmpeg'
brew 'xz'
brew 'zlib'

brew 'awk'
brew 'btop'
brew 'duckdb'
brew 'eza'
brew 'fzf'
brew 'htop'
brew 'imagemagick'
brew 'jq'
brew 'koekeishiya/formulae/yabai'
brew 'koekeishiya/formulae/skhd'
brew 'libgit2'
brew 'librsvg'  # required by Quarto to convert SVG to PDF
brew 'mas'
brew 'neovim'
brew 'pandoc'
brew 'pass'
brew 'postgresql'
brew 'ripgrep'  # required by Telescope (Neovim plugin) to respect .gitignore 
brew 'sqlite3'
brew 'tldr'
brew 'tree'
brew 'wget'
brew 'zoxide'
brew 'zsh'

cask_args appdir: '/Applications'

cask 'alfred'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'julia'
cask 'karabiner-elements'
cask 'opera'
cask 'slack'
cask 'spotify'
cask 'visual-studio-code'

mas "Things", id: 904280696
mas "Poolsuite FM", id: 1514817810

